Gestión de Registros
===

**Juan David Velásquez Henao**  
jdvelasq@unal.edu.co   
Universidad Nacional de Colombia, Sede Medellín  
Facultad de Minas  
Medellín, Colombia

---

In [1]:
## conexión a la base de datos
%load_ext sql
%sql mysql+pymysql://root:root@localhost

'Connected: root@None'

In [2]:
%%sql
CREATE DATABASE IF NOT EXISTS sqldemo;
USE sqldemo;
DROP TABLE IF EXISTS persons;
CREATE TABLE persons (
    id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
    ssn VARCHAR(11),
    phone VARCHAR(14),
    city VARCHAR(30),
    maritalstatus VARCHAR(10),
    fullname VARCHAR(40),
    birthdate DATE
);

 * mysql+pymysql://root:***@localhost
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

/Users/jdvelasq/anaconda3/lib/python3.6/site-packages/pymysql/cursors.py:165: Warning: (1007, "Can't create database 'sqldemo'; database exists")
  result = self._query(query)

[]

**INSERT** 

    INSERT [INTO] tbl_name [(column_name,...)]
    {VALUES | VALUE}
    ({expression|DEFAULT},...)[,(...),...];

In [3]:
%%sql
##
## Inserta el registro en la tabla.
## Los valores están en el mismo orden de los campos.
##
INSERT INTO persons VALUES
   (NULL,"216-51-1025","(09)-5580-7527","Memphis (Tennessee)","Single","Marco Goodman","1988-06-30");
    
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.

[(1, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30))]

In [4]:
%%sql
##
## Inserta varios registros a la vez.
## Los valores deben estar en el mismo orden de los campos.
##
INSERT INTO persons VALUES
    (NULL, "116-51-1291","(07)-2905-7818","Buffalo (New York)","Married","Roxanne Kerns","1974-11-27"),
    (NULL, "177-44-1159","(09)-5062-6922","Detroit (Michigan)","Single","Regina Lauritzen","1969-07-27");
    
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
2 rows affected.
3 rows affected.

[(1, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30)),
 (2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27))]

In [5]:
%%sql
##
## Inserta registros con información parcial.
## Se indica en cuales campos se inserta la información.
##
INSERT INTO persons (maritalstatus,fullname) VALUES
    ("Divorced","Howard Samsel"),
    ("Married","Gabriel Kingston"),
    ("Single","Carrie Bigelow");
    
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
3 rows affected.
6 rows affected.

[(1, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30)),
 (2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27)),
 (4, None, None, None, 'Divorced', 'Howard Samsel', None),
 (5, None, None, None, 'Married', 'Gabriel Kingston', None),
 (6, None, None, None, 'Single', 'Carrie Bigelow', None)]

In [6]:
%%sql
INSERT INTO persons (fullname,city,maritalstatus,birthdate)
    VALUES ("Nichelle Thaxton","Milwaukee (Wisconsin)","Married", "1988-01-02");

SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
7 rows affected.

[(1, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30)),
 (2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27)),
 (4, None, None, None, 'Divorced', 'Howard Samsel', None),
 (5, None, None, None, 'Married', 'Gabriel Kingston', None),
 (6, None, None, None, 'Single', 'Carrie Bigelow', None),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2))]

In [7]:
%%sql
##
## Inserta un registro con información en un solo campo.
## Se indica en cual campo se inserta la información
##
INSERT persons (fullname) VALUE ("Joaquin Yap");
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
8 rows affected.

[(1, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30)),
 (2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27)),
 (4, None, None, None, 'Divorced', 'Howard Samsel', None),
 (5, None, None, None, 'Married', 'Gabriel Kingston', None),
 (6, None, None, None, 'Single', 'Carrie Bigelow', None),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2)),
 (8, None, None, None, None, 'Joaquin Yap', None)]

In [8]:
%%sql
##
## Se inserta información en un registro.
## No se indican los nombres de los campos.
## Se usa NULL para los campos que no tienen información.
##
INSERT INTO persons VALUES
    (NULL, NULL, NULL, "Las Vegas (Nevada)","Married","Yu Kittredge","1978-01-22");
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
9 rows affected.

[(1, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30)),
 (2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27)),
 (4, None, None, None, 'Divorced', 'Howard Samsel', None),
 (5, None, None, None, 'Married', 'Gabriel Kingston', None),
 (6, None, None, None, 'Single', 'Carrie Bigelow', None),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2)),
 (8, None, None, None, None, 'Joaquin Yap', None),
 (9, None, None, 'Las Vegas (Nevada)', 'Married', 'Yu Kittredge', datetime.date(1978, 1, 22))]

**UPDATE**

     UPDATE tbl_name
     (SET col_name={expression|DEFAULT}, ...)
     [WHERE where_conditions];

In [9]:
%%sql
##
## Se actualiza la información de los campos de registros existentes.
## Se indica explictamente el valor de cada campo.
## Si no se introduce la clausura WHERE se cambian todos los 
## los registros de la tabla.
##
UPDATE persons SET
    ssn = "323-51-1535", phone = "(03)-5179-6500"
    WHERE fullname = "Yu Kittredge";
    
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
9 rows affected.

[(1, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30)),
 (2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27)),
 (4, None, None, None, 'Divorced', 'Howard Samsel', None),
 (5, None, None, None, 'Married', 'Gabriel Kingston', None),
 (6, None, None, None, 'Single', 'Carrie Bigelow', None),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2)),
 (8, None, None, None, None, 'Joaquin Yap', None),
 (9, '323-51-1535', '(03)-5179-6500', 'Las Vegas (Nevada)', 'Married', 'Yu Kittredge', datetime.date(1978, 1, 22))]

In [10]:
%%sql
##
## Se actualiza el campo con base en el indicador.
##
UPDATE persons SET 
   ssn = "116-81-1883" 
WHERE id = 4;

SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
9 rows affected.

[(1, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30)),
 (2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27)),
 (4, '116-81-1883', None, None, 'Divorced', 'Howard Samsel', None),
 (5, None, None, None, 'Married', 'Gabriel Kingston', None),
 (6, None, None, None, 'Single', 'Carrie Bigelow', None),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2)),
 (8, None, None, None, None, 'Joaquin Yap', None),
 (9, '323-51-1535', '(03)-5179-6500', 'Las Vegas (Nevada)', 'Married', 'Yu Kittredge', datetime.date(1978, 1, 22))]

**DELETE**

    DELETE FROM tbl_name [WHERE where_conditions];

In [11]:
%%sql
##  
## Se borran registros de la tabla.
## Si no se usa WHERE se borran todos los registros de la tabla.
##
DELETE FROM 
  persons
WHERE 
  ssn="216-51-1025" AND maritalstatus="Single";

SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.
8 rows affected.

[(2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27)),
 (4, '116-81-1883', None, None, 'Divorced', 'Howard Samsel', None),
 (5, None, None, None, 'Married', 'Gabriel Kingston', None),
 (6, None, None, None, 'Single', 'Carrie Bigelow', None),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2)),
 (8, None, None, None, None, 'Joaquin Yap', None),
 (9, '323-51-1535', '(03)-5179-6500', 'Las Vegas (Nevada)', 'Married', 'Yu Kittredge', datetime.date(1978, 1, 22))]

**Escritura de datos al disco**

    SELECT ... INTO OUTFILE '<filename>'

In [12]:
!rm /tmp/persons.txt

rm: /tmp/persons.txt: No such file or directory

In [13]:
%%sql
## 
## Permite escribir el contenido de una tabla al disco duro.
## El archivo se genera el directorio /tmp en mac os.
## Si el archivo ya existe genera un error.
## 
SELECT * FROM persons INTO OUTFILE "/tmp/persons.txt"

 * mysql+pymysql://root:***@localhost
8 rows affected.

[]

In [14]:
##
## Contenido del archivo exportado.
## Note que no tiene cabecera.
## 
!cat /tmp/persons.txt

2	116-51-1291	(07)-2905-7818	Buffalo (New York)	Married	Roxanne Kerns	1974-11-27
3	177-44-1159	(09)-5062-6922	Detroit (Michigan)	Single	Regina Lauritzen	1969-07-27
4	116-81-1883	\N	\N	Divorced	Howard Samsel	\N
5	\N	\N	\N	Married	Gabriel Kingston	\N
6	\N	\N	\N	Single	Carrie Bigelow	\N
7	\N	\N	Milwaukee (Wisconsin)	Married	Nichelle Thaxton	1988-01-02
8	\N	\N	\N	\N	Joaquin Yap	\N
9	323-51-1535	(03)-5179-6500	Las Vegas (Nevada)	Married	Yu Kittredge	1978-01-22

**Carga de datos desde arthicos de texto.**

    LOAD DATA [LOCAL] INFILE filename>'
    INTO TABLE <tablename> [(<column_name>[, <column_name>,...]];

In [15]:
%%writefile /tmp/data.txt
ssn,phone,city,maritalstatus,fullname,birthday
216-51-1025,(09)-5580-7527,Memphis (Tennessee),Single,Marco Goodman,1988-06-30
216-85-1367,(07)-2905-9114,Saint Paul (Minnesota),Divorced,Tania Raley,1974-12-16
166-82-1605,(09)-6473-4208,Irvine (California),Married,Demetrius Fry,1975-03-27
116-54-1259,(04)-3468-6535,San Bernardino (California),Divorced,Jake Vansant,1980-02-01
224-55-1496,(03)-8685-6502,Aurora (Colorado),Common-Law,Tamesha Lawlor,1974-10-02
177-44-1054,(08)-5902-5867,El Paso (Texas),Single,Millie Lasher,1974-03-29
320-54-1856,(04)-3858-1079,Houston (Texas),Divorced,Lilly Macdonald,1983-09-07

Writing /tmp/data.txt

In [16]:
%%sql
##
## Permite cargar datos desde el disco duro.
## Es el complemento de SELECT ... INTO ...
## La BD debe estar configurada para permitir carga de datos.
## Se debe indicar el orden de los campos en el archivo.
## El archivo no contiene cabecera.
##
LOAD DATA INFILE
   '/tmp/data.txt'
INTO TABLE persons
FIELDS TERMINATED BY ',' IGNORE 1 LINES (ssn,phone,city,maritalstatus,fullname,birthdate);

SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
7 rows affected.
15 rows affected.

[(2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27)),
 (4, '116-81-1883', None, None, 'Divorced', 'Howard Samsel', None),
 (5, None, None, None, 'Married', 'Gabriel Kingston', None),
 (6, None, None, None, 'Single', 'Carrie Bigelow', None),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2)),
 (8, None, None, None, None, 'Joaquin Yap', None),
 (9, '323-51-1535', '(03)-5179-6500', 'Las Vegas (Nevada)', 'Married', 'Yu Kittredge', datetime.date(1978, 1, 22)),
 (10, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30)),
 (11, '216-85-1367', '(07)-2905-9114', 'Saint Paul (Minnesota)', 'Divorced', 'Tania Raley', datetime.date(1974, 12, 16)),
 (12, '166-82-1605', '(09)-6473-4208', 'Irvine (California)', 'Married', 'Demetrius Fry', datetime.date(1975, 3, 27)),
 (13, '116-54-1259', '(04)-3468-6535', 'San Bernardino (California)', 'Divorced', 'Jake Vansant', datetime.date(1980, 2, 1)),
 (14, '224-55-1496', '(03)-8685-6502', 'Aurora (Colorado)', 'Common-Law', 'Tamesha Lawlor', datetime.date(1974, 10, 2)),
 (15, '177-44-1054', '(08)-5902-5867', 'El Paso (Texas)', 'Single', 'Millie Lasher', datetime.date(1974, 3, 29)),
 (16, '320-54-1856', '(04)-3858-1079', 'Houston (Texas)', 'Divorced', 'Lilly Macdonald', datetime.date(1983, 9, 7))]

In [17]:
!rm /tmp/data.txt

**SELECT**

    SELECT what FROM tbl_name [WHERE where-conditions] [ORDER BY column_name];

In [18]:
%%sql
##
## Este es el comando básico para visualizar el contenido de la BD
##
SELECT * FROM persons;

 * mysql+pymysql://root:***@localhost
15 rows affected.

[(2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27)),
 (4, '116-81-1883', None, None, 'Divorced', 'Howard Samsel', None),
 (5, None, None, None, 'Married', 'Gabriel Kingston', None),
 (6, None, None, None, 'Single', 'Carrie Bigelow', None),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2)),
 (8, None, None, None, None, 'Joaquin Yap', None),
 (9, '323-51-1535', '(03)-5179-6500', 'Las Vegas (Nevada)', 'Married', 'Yu Kittredge', datetime.date(1978, 1, 22)),
 (10, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30)),
 (11, '216-85-1367', '(07)-2905-9114', 'Saint Paul (Minnesota)', 'Divorced', 'Tania Raley', datetime.date(1974, 12, 16)),
 (12, '166-82-1605', '(09)-6473-4208', 'Irvine (California)', 'Married', 'Demetrius Fry', datetime.date(1975, 3, 27)),
 (13, '116-54-1259', '(04)-3468-6535', 'San Bernardino (California)', 'Divorced', 'Jake Vansant', datetime.date(1980, 2, 1)),
 (14, '224-55-1496', '(03)-8685-6502', 'Aurora (Colorado)', 'Common-Law', 'Tamesha Lawlor', datetime.date(1974, 10, 2)),
 (15, '177-44-1054', '(08)-5902-5867', 'El Paso (Texas)', 'Single', 'Millie Lasher', datetime.date(1974, 3, 29)),
 (16, '320-54-1856', '(04)-3858-1079', 'Houston (Texas)', 'Divorced', 'Lilly Macdonald', datetime.date(1983, 9, 7))]

In [19]:
%%sql
##
## Se limita la cantidad de registros a visualizar.
##
SELECT * FROM persons LIMIT 3;

 * mysql+pymysql://root:***@localhost
3 rows affected.

[(2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27)),
 (4, '116-81-1883', None, None, 'Divorced', 'Howard Samsel', None)]

In [24]:
%%sql
SELECT DISTINCT maritalstatus FROM persons;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('Married',), ('Single',), ('Divorced',), (None,), ('Common-Law',)]

In [25]:
%%sql
##
## Se indica que campos se desean seleccionar.
##
SELECT ssn,fullname FROM persons;

 * mysql+pymysql://root:***@localhost
15 rows affected.

[('116-51-1291', 'Roxanne Kerns'),
 ('177-44-1159', 'Regina Lauritzen'),
 ('116-81-1883', 'Howard Samsel'),
 (None, 'Gabriel Kingston'),
 (None, 'Carrie Bigelow'),
 (None, 'Nichelle Thaxton'),
 (None, 'Joaquin Yap'),
 ('323-51-1535', 'Yu Kittredge'),
 ('216-51-1025', 'Marco Goodman'),
 ('216-85-1367', 'Tania Raley'),
 ('166-82-1605', 'Demetrius Fry'),
 ('116-54-1259', 'Jake Vansant'),
 ('224-55-1496', 'Tamesha Lawlor'),
 ('177-44-1054', 'Millie Lasher'),
 ('320-54-1856', 'Lilly Macdonald')]

**WHERE**

In [26]:
%%sql
##
## Condicional.
##
SELECT * FROM persons WHERE birthdate >= "1974-01-01";

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2)),
 (9, '323-51-1535', '(03)-5179-6500', 'Las Vegas (Nevada)', 'Married', 'Yu Kittredge', datetime.date(1978, 1, 22)),
 (10, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30)),
 (11, '216-85-1367', '(07)-2905-9114', 'Saint Paul (Minnesota)', 'Divorced', 'Tania Raley', datetime.date(1974, 12, 16)),
 (12, '166-82-1605', '(09)-6473-4208', 'Irvine (California)', 'Married', 'Demetrius Fry', datetime.date(1975, 3, 27)),
 (13, '116-54-1259', '(04)-3468-6535', 'San Bernardino (California)', 'Divorced', 'Jake Vansant', datetime.date(1980, 2, 1)),
 (14, '224-55-1496', '(03)-8685-6502', 'Aurora (Colorado)', 'Common-Law', 'Tamesha Lawlor', datetime.date(1974, 10, 2)),
 (15, '177-44-1054', '(08)-5902-5867', 'El Paso (Texas)', 'Single', 'Millie Lasher', datetime.date(1974, 3, 29)),
 (16, '320-54-1856', '(04)-3858-1079', 'Houston (Texas)', 'Divorced', 'Lilly Macdonald', datetime.date(1983, 9, 7))]

In [27]:
%%sql
##
## Condicional para cadenas de caracteres.
##
SELECT * FROM persons WHERE fullname LIKE "R%";

 * mysql+pymysql://root:***@localhost
2 rows affected.

[(2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27))]

In [28]:
%%sql
##
## Conectores lógicos (OR).
##
SELECT * FROM persons WHERE maritalstatus = 'Married' OR fullname LIKE 'R%';

 * mysql+pymysql://root:***@localhost
6 rows affected.

[(2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27)),
 (5, None, None, None, 'Married', 'Gabriel Kingston', None),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2)),
 (9, '323-51-1535', '(03)-5179-6500', 'Las Vegas (Nevada)', 'Married', 'Yu Kittredge', datetime.date(1978, 1, 22)),
 (12, '166-82-1605', '(09)-6473-4208', 'Irvine (California)', 'Married', 'Demetrius Fry', datetime.date(1975, 3, 27))]

In [29]:
%%sql
##
## Conectores lógicos (AND).
##
SELECT * FROM persons WHERE maritalstatus = 'Married' AND fullname LIKE 'R%';

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27))]

In [30]:
%%sql
##
## Ordenamiento
##
SELECT * FROM persons ORDER BY maritalstatus LIMIT 4;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[(8, None, None, None, None, 'Joaquin Yap', None),
 (14, '224-55-1496', '(03)-8685-6502', 'Aurora (Colorado)', 'Common-Law', 'Tamesha Lawlor', datetime.date(1974, 10, 2)),
 (16, '320-54-1856', '(04)-3858-1079', 'Houston (Texas)', 'Divorced', 'Lilly Macdonald', datetime.date(1983, 9, 7)),
 (4, '116-81-1883', None, None, 'Divorced', 'Howard Samsel', None)]

In [31]:
%%sql
##
## Condicional para campos string
##
SELECT * FROM persons WHERE maritalstatus IN ('Married','Divorced');

 * mysql+pymysql://root:***@localhost
9 rows affected.

[(2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (4, '116-81-1883', None, None, 'Divorced', 'Howard Samsel', None),
 (5, None, None, None, 'Married', 'Gabriel Kingston', None),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2)),
 (9, '323-51-1535', '(03)-5179-6500', 'Las Vegas (Nevada)', 'Married', 'Yu Kittredge', datetime.date(1978, 1, 22)),
 (11, '216-85-1367', '(07)-2905-9114', 'Saint Paul (Minnesota)', 'Divorced', 'Tania Raley', datetime.date(1974, 12, 16)),
 (12, '166-82-1605', '(09)-6473-4208', 'Irvine (California)', 'Married', 'Demetrius Fry', datetime.date(1975, 3, 27)),
 (13, '116-54-1259', '(04)-3468-6535', 'San Bernardino (California)', 'Divorced', 'Jake Vansant', datetime.date(1980, 2, 1)),
 (16, '320-54-1856', '(04)-3858-1079', 'Houston (Texas)', 'Divorced', 'Lilly Macdonald', datetime.date(1983, 9, 7))]

In [32]:
%%sql
##
## Condicional para campos string
##
SELECT * FROM persons WHERE maritalstatus NOT IN ('Married','Divorced');

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27)),
 (6, None, None, None, 'Single', 'Carrie Bigelow', None),
 (10, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30)),
 (14, '224-55-1496', '(03)-8685-6502', 'Aurora (Colorado)', 'Common-Law', 'Tamesha Lawlor', datetime.date(1974, 10, 2)),
 (15, '177-44-1054', '(08)-5902-5867', 'El Paso (Texas)', 'Single', 'Millie Lasher', datetime.date(1974, 3, 29))]

In [33]:
%%sql
##
## Combinación de clausulas opcionales.
##
SELECT * FROM persons WHERE birthdate >= '1970-01-01' ORDER BY fullname;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(12, '166-82-1605', '(09)-6473-4208', 'Irvine (California)', 'Married', 'Demetrius Fry', datetime.date(1975, 3, 27)),
 (13, '116-54-1259', '(04)-3468-6535', 'San Bernardino (California)', 'Divorced', 'Jake Vansant', datetime.date(1980, 2, 1)),
 (16, '320-54-1856', '(04)-3858-1079', 'Houston (Texas)', 'Divorced', 'Lilly Macdonald', datetime.date(1983, 9, 7)),
 (10, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30)),
 (15, '177-44-1054', '(08)-5902-5867', 'El Paso (Texas)', 'Single', 'Millie Lasher', datetime.date(1974, 3, 29)),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2)),
 (2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27)),
 (14, '224-55-1496', '(03)-8685-6502', 'Aurora (Colorado)', 'Common-Law', 'Tamesha Lawlor', datetime.date(1974, 10, 2)),
 (11, '216-85-1367', '(07)-2905-9114', 'Saint Paul (Minnesota)', 'Divorced', 'Tania Raley', datetime.date(1974, 12, 16)),
 (9, '323-51-1535', '(03)-5179-6500', 'Las Vegas (Nevada)', 'Married', 'Yu Kittredge', datetime.date(1978, 1, 22))]

In [34]:
%%sql
##
## Calcula la edad promedio de las personas.
##
SELECT AVG(TIMESTAMPDIFF(YEAR,birthdate,CURDATE())) AS PROM FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(Decimal('39.5455'),)]

**FUNCIONES**

In [35]:
%%sql
##
## Cuenta cuantos registros hay en la tabla.
##
SELECT COUNT(*) FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(15,)]

In [36]:
%%sql
##
## Cuenta la cantidad de registros con información 
## en el campo fullname
##
SELECT COUNT(fullname) FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(15,)]

In [37]:
%%sql
##
## Calcula la suma de edades en personas
##
SELECT SUM(TIMESTAMPDIFF(YEAR,birthdate,CURDATE())) AS SUMA FROM persons;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(Decimal('435'),)]

In [38]:
%%sql
##
## Cuenta cuantas veces aparece cada año
## de nacimiento en la tabla.
##
SELECT YEAR(birthdate), COUNT(*) FROM persons GROUP BY YEAR(birthdate);

 * mysql+pymysql://root:***@localhost
8 rows affected.

[(None, 4),
 (1969, 1),
 (1974, 4),
 (1975, 1),
 (1978, 1),
 (1980, 1),
 (1983, 1),
 (1988, 2)]

In [38]:
%%sql
##
## Cuenta cuantas veces aparece cada año
## de nacimiento en la tabla.
##
SELECT YEAR(birthdate), COUNT(*) FROM persons GROUP BY YEAR(birthdate);

 * mysql+pymysql://root:***@localhost
8 rows affected.

[(None, 4),
 (1969, 1),
 (1974, 4),
 (1975, 1),
 (1978, 1),
 (1980, 1),
 (1983, 1),
 (1988, 2)]

In [45]:
%%sql
##
## Agrega la edad
##
SELECT *, TIMESTAMPDIFF(YEAR,birthdate,CURDATE()) AS AGE, MONTH(birthdate) FROM persons;

 * mysql+pymysql://root:***@localhost
15 rows affected.

[(2, '116-51-1291', '(07)-2905-7818', 'Buffalo (New York)', 'Married', 'Roxanne Kerns', datetime.date(1974, 11, 27), 43, 11),
 (3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27), 48, 7),
 (4, '116-81-1883', None, None, 'Divorced', 'Howard Samsel', None, None, None),
 (5, None, None, None, 'Married', 'Gabriel Kingston', None, None, None),
 (6, None, None, None, 'Single', 'Carrie Bigelow', None, None, None),
 (7, None, None, 'Milwaukee (Wisconsin)', 'Married', 'Nichelle Thaxton', datetime.date(1988, 1, 2), 30, 1),
 (8, None, None, None, None, 'Joaquin Yap', None, None, None),
 (9, '323-51-1535', '(03)-5179-6500', 'Las Vegas (Nevada)', 'Married', 'Yu Kittredge', datetime.date(1978, 1, 22), 40, 1),
 (10, '216-51-1025', '(09)-5580-7527', 'Memphis (Tennessee)', 'Single', 'Marco Goodman', datetime.date(1988, 6, 30), 29, 6),
 (11, '216-85-1367', '(07)-2905-9114', 'Saint Paul (Minnesota)', 'Divorced', 'Tania Raley', datetime.date(1974, 12, 16), 43, 12),
 (12, '166-82-1605', '(09)-6473-4208', 'Irvine (California)', 'Married', 'Demetrius Fry', datetime.date(1975, 3, 27), 43, 3),
 (13, '116-54-1259', '(04)-3468-6535', 'San Bernardino (California)', 'Divorced', 'Jake Vansant', datetime.date(1980, 2, 1), 38, 2),
 (14, '224-55-1496', '(03)-8685-6502', 'Aurora (Colorado)', 'Common-Law', 'Tamesha Lawlor', datetime.date(1974, 10, 2), 43, 10),
 (15, '177-44-1054', '(08)-5902-5867', 'El Paso (Texas)', 'Single', 'Millie Lasher', datetime.date(1974, 3, 29), 44, 3),
 (16, '320-54-1856', '(04)-3858-1079', 'Houston (Texas)', 'Divorced', 'Lilly Macdonald', datetime.date(1983, 9, 7), 34, 9)]

> Haga click [aquí](https://dev.mysql.com/doc/refman/5.7/en/functions.html) para acceder al listado completo de funciones de MySQL.

**SUBCONSULTAS**

In [41]:
%%sql
##
## Sub-consultas.
## Busca la persona más vieja en la tabla.
##
SELECT * FROM persons WHERE birthdate = (SELECT MIN(birthdate) FROM persons);

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(3, '177-44-1159', '(09)-5062-6922', 'Detroit (Michigan)', 'Single', 'Regina Lauritzen', datetime.date(1969, 7, 27))]

---

Gestión de Registros
===

**Juan David Velásquez Henao**  
jdvelasq@unal.edu.co   
Universidad Nacional de Colombia, Sede Medellín  
Facultad de Minas  
Medellín, Colombia